{
    "privacyPolicy": "Privacy Policy\n\nEffective Date: 8/10/2024\n\n1. Introduction\n\nThis Privacy Policy (\"Policy\") outlines the types of information collected by OnlyPosts (\"we,\" \"us,\" or \"our\") through our application (\"Service\") and how we use, disclose, and protect that information. By using our Service, you agree to the collection and use of information in accordance with this Policy.\n\n2. Information We Collect\n\n- Personal Information: We collect certain personally identifiable information, including but not limited to your email address and login credentials for third-party social media platforms (Twitter, Reddit, TikTok, YouTube), when you register or log in to the Service.\n\n- User-Generated Content: Users may upload photographs, videos, and other content (\"User Content\"), which are stored on our secure servers.\n\n3. Data Retention and Deletion\n\n- Retention: We retain your Personal Information and User Content for as long as your account remains active.\n\n- Deletion: Upon account deletion, all associated Personal Information and User Content will be irretrievably deleted from our servers. We do not retain any copies of your data once your account is deleted.\n\n4. Data Security\n\n- Encryption: Usernames and passwords are stored in an encrypted format within our database.\n\n- Server Security: Our servers are secured with industry-standard encryption and access control mechanisms to prevent unauthorized access.\n\n- Breach Notification: In the event of a data breach or unauthorized access to your data, we will promptly notify you via email and may notify relevant authorities to pursue legal action against the perpetrators.\n\n5. User Rights and Data Requests\n\n- Access Requests: Users have the right to request access to their Personal Information stored by us. All such requests must be submitted via our support page.\n\n- Privacy Inquiries: Users may submit inquiries regarding their privacy rights or our data practices through our support page.\n\n6. Cookies and Authentication\n\n- Cookies: We do not use cookies or similar tracking technologies within our Service.\n\n- JWT Tokens: We utilize JSON Web Tokens (JWT) for user authentication and session management.\n\n7. AI Interaction and Data Usage\n\n- AI Training: By using the Service, you acknowledge and agree that your interactions with our AI tools may be utilized by OpenAI for the purpose of training and improving future AI models. Opting out of this data usage is not permitted, as it is a requirement of the OpenAI API, which we utilize.\n\n8. Disclosure of Information\n\n- Third-Party Disclosure: We do not sell, trade, or otherwise transfer your Personal Information or User Content to outside parties. We do not share your information with third parties unless required by law.\n\n9. Compliance with Legal Obligations\n\n- Legal Requirements: We comply with all applicable data protection and privacy laws and regulations. We may disclose your Personal Information if required to do so by law or in response to valid requests by public authorities (e.g., a court or a government agency).\n\n10. Changes to This Policy\n\n- Policy Updates: We reserve the right to update or modify this Policy at any time. We will notify users of any significant changes via email or through the Service. Your continued use of the Service following any changes to this Policy constitutes your acceptance of the revised Policy.\n\n11. Contact Information\n\nIf you have any questions, concerns, or requests related to this Privacy Policy or your personal data, please contact us via the support page on our website.",
    "ToS": "Terms of Service\n\nEffective Date: [Insert Date]\n\n1. Introduction\n\nWelcome to OnlyPosts. These Terms of Service (\"Terms\") govern your access to and use of our application (\"Service\"). By using our Service, you agree to comply with and be bound by these Terms. If you do not agree with these Terms, please refrain from using our Service.\n\n2. Description of Service\n\nOnlyPosts provides a platform that enables users to:\n\n- Create and schedule posts, including text, videos, and photographs, to various social media platforms, including Twitter, Reddit, YouTube, and TikTok.\n\n- Set up automated tasks to send direct messages, comments, or replies to enhance their brand or following.\n\n- Utilize artificial intelligence tools to generate custom messages, captions, and descriptions, or to create random videos based on user-provided media.\n\n3. User Responsibilities\n\nUsers are solely responsible for:\n\n- Creating and managing post jobs, including specifying the type and timing of posts.\n\n- Uploading lawful content and ensuring that all content complies with the terms and conditions of the respective social media platforms.\n\n- Understanding and adhering to the rules and policies of any social media site to which they post content.\n\n- Any repercussions resulting from the posting of NSFW content or other restricted content on platforms that do not permit such content.\n\n4. Content Ownership and Use\n\n- Users retain ownership of the content they upload. However, by using our Service, users grant OnlyPosts a non-exclusive, worldwide, royalty-free license to use, modify, and distribute their content as necessary to provide the Service.\n\n- Our Service may utilize AI to generate or alter content based on user inputs, including descriptions and media. Users acknowledge and consent to such modifications.\n\n5. Account Management and Deletion\n\n- Users may manage their accounts and delete media through the media manager. Upon account deletion, all associated media and metadata will be irretrievably removed from our servers.\n\n- In the event of account suspension or termination, all user data will be permanently deleted, and access to the account will be irrevocably terminated.\n\n6. Fees and Payment\n\n- OnlyPosts offers a free tier supported by advertisements. Users may opt for a paid subscription, which provides additional features, removes advertisements, and permits multiple social media accounts.\n\n- Payments are processed through Stripe. Users may cancel their subscriptions through the user settings page. Please note that payments are non-refundable.\n\n7. Limitation of Liability\n\n- OnlyPosts shall not be liable for any claims arising from the use of the Service. Users assume full responsibility and risk for all content posted and distributed through the Service.\n\n8. Indemnification\n\n- Users agree to indemnify, defend, and hold harmless OnlyPosts, its affiliates, and their respective officers, directors, employees, and agents from and against any claims, liabilities, damages, losses, and expenses (including legal fees) arising out of or in any way connected with their use of the Service or any violation of these Terms.\n\n9. Governing Law and Dispute Resolution\n\n- These Terms are governed by and construed in accordance with the laws of the United States. Any disputes arising from these Terms or the use of the Service will be resolved through email communication, and if necessary, through arbitration or mediation.\n\n10. Changes to Terms\n\n- OnlyPosts reserves the right to modify or update these Terms at any time. Users will be notified of significant changes via email. Continued use of the Service following any changes constitutes acceptance of the revised Terms.\n\n11. Contact Information\n\n- For any questions, concerns, or requests related to these Terms of Service, please contact us via the support page on our website."
}
